app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE (
---
  def register
    @image = Image.no_label.reorder(id: :asc).first

SELECT "images".* FROM "images" WHERE (label1 like '%ねこ%' or label2 like '%ねこ%' or label3 like '%ねこ%')  ORDER BY "images"."id" ASC, rate desc
SELECT  "images".* FROM "images" WHERE (label1 like '%ねこ%' or label2 like '%ねこ%' or label3 like '%ねこ%')  ORDER BY "images"."id" ASC, rate desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "images" WHERE (label1 like '%ねこ%' or label2 like '%ねこ%' or label3 like '%ねこ%')
---
  def search
    @images = Image.label_like(params[:query]).order_by_rate
    @params = params
    @images = @images.page params[:page]

SELECT  "images".* FROM "images" WHERE (true)  ORDER BY "images"."id" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "images" WHERE (true)
---
  def index
    @images = Image.where('true').page params[:page]

SELECT  "images".* FROM "images" WHERE "images"."id" = $1  ORDER BY "images"."id" ASC LIMIT 1  [["id", 2]]
---
  def edit
    @image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1  ORDER BY "images"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "images" SET "label1" = $1, "label2" = $2, "label3" = $3, "updated_at" = $4 WHERE "images"."id" = $5  [["label1", "ぞう"], ["label2", ""], ["label3", ""], ["updated_at", "2016-04-19 08:28:04.969229"], ["id", 2]]
---
  def update
    @image = Image.find(params[:id])
    if @image.update_attributes(user_params)

SELECT  "images".* FROM "images" WHERE "images"."id" = $1  ORDER BY "images"."id" ASC LIMIT 1  [["id", 3]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 3]]
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy!

SELECT  "images".* FROM "images" WHERE "images"."id" = $1  ORDER BY "images"."id" ASC LIMIT 1  [["id", 2]]
---
  def show_image
    @image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1  ORDER BY "images"."id" ASC LIMIT 1  [["id", 2]]
---
  def download_image
    @image = Image.find(params[:id])